{
  "blogs": [
  {
    "id": 1,
    "title": "Transforming Gift Ideas into Reality: Behind the Art of Handcrafted Hampers",
    "slug": "transforming-gift-ideas-into-reality",
    "date": "2025-09-20",
    "author": "Team The Beadery Co.",
    "image": "/img/blogs/1.png",
    "excerpt": "Ever wondered what goes into curating a personalized gift hamper? Discover how creative collaboration and attention to detail turn simple ideas into beautiful handcrafted realities.",
    "content": "Each handcrafted gift hamper starts with a story — an idea that captures emotion, color, and personality. From selecting the theme and sourcing coordinated decor elements to hand-arranging every piece, our process is a true collaboration between imagination and craftsmanship. Whether it’s a blue-themed gift box or a festival special, we blend aesthetics with purpose to create something truly personal and memorable."
  },
  {
    "id": 2,
    "title": "Illuminate Your Festive Spaces with Handmade Candles and Decor",
    "slug": "illuminate-your-festive-spaces",
    "date": "2025-10-05",
    "author": "Team The Beadery Co.",
    "image": "/img/blogs/2.png",
    "excerpt": "Handmade candles and resin decor are redefining festive luxury. Learn how to bring warmth, color, and a personal touch to your Diwali decorations.",
    "content": "Festivals are not just about light — they’re about feeling. Our handmade Lotus Theme Jar Candles and tea-light holders combine fragrance, craftsmanship, and sacred symbolism to create radiant spaces. Each piece is poured, polished, and finished by hand, ensuring that no two are identical. Illuminate your home with elegance and invite positivity this festive season with decor that tells a story of devotion and artistry."
  },
  {
    "id": 3,
    "title": "The Charm of Resin Art: Coasters, Platters, and Beyond",
    "slug": "the-charm-of-resin-art",
    "date": "2025-09-28",
    "author": "Team The Beadery Co.",
    "image": "/img/blogs/3.png",
    "excerpt": "Resin art brings a luxurious, contemporary touch to everyday items. Explore how our coasters and pooja platters are transforming home decor aesthetics.",
    "content": "Resin art is where creativity meets chemistry. By blending pigments, metallics, and textures, we craft coasters and platters that double as art pieces. Our black-and-gold coaster sets exude bold elegance, while our resin pooja platters infuse devotion with design. Each product is hand-poured and cured with care, making every item a one-of-a-kind masterpiece that adds sophistication to your living space."
  },
  {
    "id": 4,
    "title": "Thoughtful Gifting Made Easy: The Rise of Personalized Handcrafted Gifts",
    "slug": "thoughtful-gifting-made-easy",
    "date": "2025-10-25",
    "author": "Team The Beadery Co.",
    "image": "/img/blogs/4.png",
    "excerpt": "Move beyond generic gifts. Discover why handcrafted and personalized presents create deeper connections and lasting impressions.",
    "content": "In an age of quick clicks and instant buys, handcrafted gifts stand out because they speak from the heart. Personalized hampers, themed candles, and photo frames capture the essence of relationships — effort, intention, and care. Our artisans handcraft each piece to mirror the giver’s thoughtfulness and the receiver’s joy. With every gift, you’re not just giving an object — you’re sharing a story."
  }
]

}
